app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data)
    {
        if (session('filled_form')) {
            $user = User::create([
                'firstname' => $data['firstname'],
                'lastname' => $data['lastname'],
                'email' => $data['email'],
                'role' => $data['role'],
                'password' => Hash::make($data['password']),
                'cgv' => true,
                'number_of_connections' => 0
            ]);

            $values = Session::get('filled_form');


            $projet = new Projet;
            $projet->user_id = $user->id;
            $projet->title = $values['title'];
            $projet->description = $values['description'];
            $projet->status = 'pending';
            $projet->departement_id = $values['departement'];
            $projet->budget_id = $values['budget'];
            $projet->save();
---
insert into `projets` (`user_id`, `title`, `description`, `status`, `departement_id`, `budget_id`, `updated_at`, `created_at`) values (21, 'PROJET EEE', 'Suscipit nisi voluptatibus labore et reprehenderit', 'pending', '98', '4', '2021-09-26 21:03:50', '2021-09-26 21:03:50')