app/Http/Controllers/HomeController.php

     public function list()
    {
        $categories = Category::all();
        $departements = Departement::all();
        $budgets = Budget::all();

        $projets_first = Projet::where("status", "=", "open")->orwhere("status", "=", "closed")->orderBy('created_at', 'desc')->take(3)->get();
        $projets_seconds = Projet::where("status", "=", "open")->orwhere("status", "=", "closed")->orderBy('created_at', 'desc')->skip(3)->take(3)->get();
---
select * from `categories`
select * from `departements`
select * from `budgets`
select * from `projets` where `status` = 'open' or `status` = 'closed' order by `created_at` desc limit 3
select * from `projets` where `status` = 'open' or `status` = 'closed' order by `created_at` desc limit 3 offset 3