app/Http/Controllers/ProjetController.php

select * from `categories`
select * from `departements`
select * from `budgets`
---
    public function create()
    {
        $categories = Category::all();
        $departements = Departement::all();
        $budgets = Budget::all();