app/Http/Controllers/Admin/DashboardController.php

    public function projetsList()
    {
        $projets = Projet::all();
---
select * from `projets`

    public function projetDelete($id)
    {
        $projets = Projet::findOrFail($id);
        if ($projets->delete()){
---
delete from `projets` where `id` = 2

    public function data()
    {
        $projets = Projet::all();
        $users = User::all();
        $lastprojet = Projet::orderBy('id', 'desc')->take(1)->get();
        $lastuser = User::orderBy('id', 'desc')->take(1)->get();
---
select * from `projets`
select * from `users`
select * from `projets` order by `id` desc limit 1
select * from `users` order by `id` desc limit 1